Autodesk.Revit.DB.Analysis.Polyloop.GetPoints
Gets the array of points in the polygon
Returns:
The array of points in the polygon
Since:
2012

Autodesk.Revit.DB.Analysis.Polyloop.ComputeArea
Gets the area for this polygon.
Remarks:
The area of the planar non-self-intersecting polygon computed as:
A = 1/2 * (X1 Y2) - (X2 Y1) + ... + (Xn Y1) - (X1 Yn)
Returns:
The area for this polygon.
Since:
2012

Autodesk.Revit.DB.Analysis.Polyloop.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.Polyloop.Direction
The direction for the outward normal for this polygon.
Since:
2012

Autodesk.Revit.DB.Analysis.Polyloop.Centroid
The polygon centroid.
Since:
2012

Autodesk.Revit.DB.Analysis.Polyloop
A Polyloop represent a planar polygon with ordered points.
Remarks:
This class is a loop with straight edges bounding a planar region in space.
The loop is represented by an ordered coplanar collection of points
forming the vertices of the loop. The loop is composed of straight line segments
joining a point in the collection to the succeeding point in the collection.
The closing segment is from the last to the first point in the collection.
The direction of the loop is in the direction of the line segments.
All the points in the polygon defining the poly loop shall be coplanar.
Since:
2012